Revit 2026 API

# ExportUtilsGetNurbsSurfaceDataForSurface Method

---

Returns the necessary information to define a NURBS surface for a given [!:Autodesk::Revit::DB::HermiteSuface] or [!:Autodesk::Revit::DB::RuledSuface].

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static NurbsSurfaceData GetNurbsSurfaceDataForSurface(
	Surface surface
)
```
```vb
Public Shared Function GetNurbsSurfaceDataForSurface (
	surface As Surface
) As NurbsSurfaceData
```
```cpp
public:
static NurbsSurfaceData^ GetNurbsSurfaceDataForSurface(
	Surface^ surface
)
```
```fsharp
static member GetNurbsSurfaceDataForSurface :
        surface : Surface -> NurbsSurfaceData
```

#### Parameters

surface Surface
     The HermiteSurface or RuledSurface to be converted.

#### Return Value

NurbsSurfaceData A class containing the necessary data to define a NURBS surface.

| Exception | Condition |
| --- | --- |
| ArgumentException | This surface type is not supported for this function. |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | Couldn't get NURBS data from surface. |

This function is intended for export purposes.

#### Reference

ExportUtils Class

Autodesk.Revit.DB Namespace